bstack88/line-following-robot/LineFollower/Project_Headers/mc9s08ll64.h
#define VREF1SC_MODE0_MASK              1
#define VREF1SC_MODE1_MASK              2
#define VREF1SC_VREFST_MASK             4
#define VREF1SC_VREFEN_MASK             128
#define VREF1SC_MODE_MASK               3
#define VREF1SC_MODE_BITNUM             0


/*** VREF2TRM - VREF Trim Register; 0x0000005E ***/
typedef union {
  byte Byte;
  struct {
    byte TRM0        :1;                                       /* Trim Bits, bit 0 */
    byte TRM1        :1;                                       /* Trim Bits, bit 1 */
    byte TRM2        :1;                                       /* Trim Bits, bit 2 */
    byte TRM3        :1;                                       /* Trim Bits, bit 3 */
    byte TRM4        :1;                                       /* Trim Bits, bit 4 */
    byte TRM5        :1;                                       /* Trim Bits, bit 5 */
    byte TRM6        :1;                                       /* Trim Bits, bit 6 */
    byte TRM7        :1;                                       /* Trim Bits, bit 7 */
  } Bits;
} VREF2TRMSTR;
extern volatile VREF2TRMSTR _VREF2TRM @0x0000005E;
#define VREF2TRM                        _VREF2TRM.Byte
#define VREF2TRM_TRM0                   _VREF2TRM.Bits.TRM0
#define VREF2TRM_TRM1                   _VREF2TRM.Bits.TRM1
#define VREF2TRM_TRM2                   _VREF2TRM.Bits.TRM2
#define VREF2TRM_TRM3                   _VREF2TRM.Bits.TRM3
#define VREF2TRM_TRM4                   _VREF2TRM.Bits.TRM4
#define VREF2TRM_TRM5                   _VREF2TRM.Bits.TRM5
#define VREF2TRM_TRM6                   _VREF2TRM.Bits.TRM6
#define VREF2TRM_TRM7                   _VREF2TRM.Bits.TRM7

#define VREF2TRM_TRM0_MASK              1
#define VREF2TRM_TRM1_MASK              2
#define VREF2TRM_TRM2_MASK              4
#define VREF2TRM_TRM3_MASK              8
#define VREF2TRM_TRM4_MASK              16
#define VREF2TRM_TRM5_MASK              32
#define VREF2TRM_TRM6_MASK              64
#define VREF2TRM_TRM7_MASK              128


/*** VREF2SC - VREF Control Register; 0x0000005F ***/
typedef union {
  byte Byte;
  struct {
    byte MODE0       :1;                                       /* Mode selection, bit 0 */
    byte MODE1       :1;                                       /* Mode selection, bit 1 */
    byte VREFST      :1;                                       /* Internal Voltage Reference Stable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte VREFEN      :1;                                       /* Internal Voltage Reference Enable */
  } Bits;
  struct {
    byte grpMODE :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} VREF2SCSTR;
extern volatile VREF2SCSTR _VREF2SC @0x0000005F;
#define VREF2SC                         _VREF2SC.Byte
#define VREF2SC_MODE0                   _VREF2SC.Bits.MODE0
#define VREF2SC_MODE1                   _VREF2SC.Bits.MODE1
#define VREF2SC_VREFST                  _VREF2SC.Bits.VREFST
#define VREF2SC_VREFEN                  _VREF2SC.Bits.VREFEN
#define VREF2SC_MODE                    _VREF2SC.MergedBits.grpMODE

#define VREF2SC_MODE0_MASK              1
#define VREF2SC_MODE1_MASK              2
#define VREF2SC_VREFST_MASK             4
#define VREF2SC_VREFEN_MASK             128
#define VREF2SC_MODE_MASK               3
#define VREF2SC_MODE_BITNUM             0


/*** LCDPEN0 - LCD Pin Enable Register 0; 0x00001000 ***/
typedef union {
  byte Byte;
  struct {
    byte PEN0        :1;                                       /* Enable LCD pin 0 for LCD operation */
    byte PEN1        :1;                                       /* Enable LCD pin 1 for LCD operation */
    byte PEN2        :1;                                       /* Enable LCD pin 2 for LCD operation */
    byte PEN3        :1;                                       /* Enable LCD pin 3 for LCD operation */
    byte PEN4        :1;                                       /* Enable LCD pin 4 for LCD operation */
    byte PEN5        :1;                                       /* Enable LCD pin 5 for LCD operation */
    byte PEN6        :1;                                       /* Enable LCD pin 6 for LCD operation */
    byte PEN7        :1;                                       /* Enable LCD pin 7 for LCD operation */
  } Bits;
} LCDPEN0STR;
extern volatile LCDPEN0STR _LCDPEN0 @0x00001000;
#define LCDPEN0                         _LCDPEN0.Byte
#define LCDPEN0_PEN0                    _LCDPEN0.Bits.PEN0
#define LCDPEN0_PEN1                    _LCDPEN0.Bits.PEN1
#define LCDPEN0_PEN2                    _LCDPEN0.Bits.PEN2
#define LCDPEN0_PEN3                    _LCDPEN0.Bits.PEN3
#define LCDPEN0_PEN4                    _LCDPEN0.Bits.PEN4
#define LCDPEN0_PEN5                    _LCDPEN0.Bits.PEN5
#define LCDPEN0_PEN6                    _LCDPEN0.Bits.PEN6
#define LCDPEN0_PEN7                    _LCDPEN0.Bits.PEN7
/* LCDPEN_ARR: Access 6 LCDPENx registers in an array */
#define LCDPEN_ARR                      ((volatile byte * __far) &LCDPEN0)

#define LCDPEN0_PEN0_MASK               1
#define LCDPEN0_PEN1_MASK               2
#define LCDPEN0_PEN2_MASK               4
#define LCDPEN0_PEN3_MASK               8
#define LCDPEN0_PEN4_MASK               16
#define LCDPEN0_PEN5_MASK               32
#define LCDPEN0_PEN6_MASK               64
#define LCDPEN0_PEN7_MASK               128


/*** LCDPEN1 - LCD Pin Enable Register 1; 0x00001001 ***/
typedef union {
  byte Byte;
  struct {
    byte PEN8        :1;                                       /* Enable LCD pin 8 for LCD operation */
    byte PEN9        :1;                                       /* Enable LCD pin 9 for LCD operation */
    byte PEN10       :1;                                       /* Enable LCD pin 10 for LCD operation */
    byte PEN11       :1;                                       /* Enable LCD pin 11 for LCD operation */
    byte PEN12       :1;                                       /* Enable LCD pin 12 for LCD operation */
    byte PEN13       :1;                                       /* Enable LCD pin 13 for LCD operation */
    byte PEN14       :1;                                       /* Enable LCD pin 14 for LCD operation */
    byte PEN15       :1;                                       /* Enable LCD pin 15 for LCD operation */
  } Bits;
} LCDPEN1STR;
extern volatile LCDPEN1STR _LCDPEN1 @0x00001001;
#define LCDPEN1                         _LCDPEN1.Byte
#define LCDPEN1_PEN8                    _LCDPEN1.Bits.PEN8
#define LCDPEN1_PEN9                    _LCDPEN1.Bits.PEN9
#define LCDPEN1_PEN10                   _LCDPEN1.Bits.PEN10
#define LCDPEN1_PEN11                   _LCDPEN1.Bits.PEN11
#define LCDPEN1_PEN12                   _LCDPEN1.Bits.PEN12
#define LCDPEN1_PEN13                   _LCDPEN1.Bits.PEN13
#define LCDPEN1_PEN14                   _LCDPEN1.Bits.PEN14
#define LCDPEN1_PEN15                   _LCDPEN1.Bits.PEN15

