bstack88/line-following-robot/LineFollower/Project_Headers/mc9s08ll64.h
    /*** ADCCVL - Compare Value Low Register; 0x00001881 ***/
    union {
      byte Byte;
      struct {
        byte CV0         :1;                                       /* Compare Function Value 0 */
        byte CV1         :1;                                       /* Compare Function Value 1 */
        byte CV2         :1;                                       /* Compare Function Value 2 */
        byte CV3         :1;                                       /* Compare Function Value 3 */
        byte CV4         :1;                                       /* Compare Function Value 4 */
        byte CV5         :1;                                       /* Compare Function Value 5 */
        byte CV6         :1;                                       /* Compare Function Value 6 */
        byte CV7         :1;                                       /* Compare Function Value 7 */
      } Bits;
    } ADCCVLSTR;
    #define ADCCVL                      _ADCCV.Overlap_STR.ADCCVLSTR.Byte
    #define ADCCVL_CV0                  _ADCCV.Overlap_STR.ADCCVLSTR.Bits.CV0
    #define ADCCVL_CV1                  _ADCCV.Overlap_STR.ADCCVLSTR.Bits.CV1
    #define ADCCVL_CV2                  _ADCCV.Overlap_STR.ADCCVLSTR.Bits.CV2
    #define ADCCVL_CV3                  _ADCCV.Overlap_STR.ADCCVLSTR.Bits.CV3
    #define ADCCVL_CV4                  _ADCCV.Overlap_STR.ADCCVLSTR.Bits.CV4
    #define ADCCVL_CV5                  _ADCCV.Overlap_STR.ADCCVLSTR.Bits.CV5
    #define ADCCVL_CV6                  _ADCCV.Overlap_STR.ADCCVLSTR.Bits.CV6
    #define ADCCVL_CV7                  _ADCCV.Overlap_STR.ADCCVLSTR.Bits.CV7
    
    #define ADCCVL_CV0_MASK             1
    #define ADCCVL_CV1_MASK             2
    #define ADCCVL_CV2_MASK             4
    #define ADCCVL_CV3_MASK             8
    #define ADCCVL_CV4_MASK             16
    #define ADCCVL_CV5_MASK             32
    #define ADCCVL_CV6_MASK             64
    #define ADCCVL_CV7_MASK             128
    
  } Overlap_STR;

} ADCCVSTR;
extern volatile ADCCVSTR _ADCCV @0x00001880;
#define ADCCV                           _ADCCV.Word


/*** ADCSC2 - Status and Control Register 2; 0x00001884 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte ACFGT       :1;                                       /* Compare Function Greater Than Enable */
    byte ACFE        :1;                                       /* Compare Function Enable - ACFE is used to enable the compare function */
    byte ADTRG       :1;                                       /* Conversion Trigger Select-ADTRG is used to select the type of trigger to be used for initiating a conversion */
    byte ADACT       :1;                                       /* Conversion Active - ADACT indicates that a conversion is in progress. ADACT is set when a conversion is initiated and cleared when a conversion is completed or aborted */
  } Bits;
} ADCSC2STR;
extern volatile ADCSC2STR _ADCSC2 @0x00001884;
#define ADCSC2                          _ADCSC2.Byte
#define ADCSC2_ACFGT                    _ADCSC2.Bits.ACFGT
#define ADCSC2_ACFE                     _ADCSC2.Bits.ACFE
#define ADCSC2_ADTRG                    _ADCSC2.Bits.ADTRG
#define ADCSC2_ADACT                    _ADCSC2.Bits.ADACT

#define ADCSC2_ACFGT_MASK               16
#define ADCSC2_ACFE_MASK                32
#define ADCSC2_ADTRG_MASK               64
#define ADCSC2_ADACT_MASK               128


/*** ADCSC3 - Status and Control Register 3; 0x00001885 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte ADCO        :1;                                       /* Continuous Conversion Enable - ADCO enables continuous conversions */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} ADCSC3STR;
extern volatile ADCSC3STR _ADCSC3 @0x00001885;
#define ADCSC3                          _ADCSC3.Byte
#define ADCSC3_ADCO                     _ADCSC3.Bits.ADCO

#define ADCSC3_ADCO_MASK                8


/*** APCTL1 - Pin Control 1 Register; 0x0000189F ***/
typedef union {
  byte Byte;
  struct {
    byte ADPC0       :1;                                       /* ADC Pin Control 0 - ADPC0 is used to control the pin associated with channel AD0 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte ADPC4       :1;                                       /* ADC Pin Control 4 - ADPC4 is used to control the pin associated with channel AD4 */
    byte ADPC5       :1;                                       /* ADC Pin Control 5 - ADPC5 is used to control the pin associated with channel AD5 */
    byte ADPC6       :1;                                       /* ADC Pin Control 6 - ADPC6 is used to control the pin associated with channel AD6 */
    byte ADPC7       :1;                                       /* ADC Pin Control 7 - ADPC7 is used to control the pin associated with channel AD7 */
  } Bits;
  struct {
    byte grpADPC :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpADPC_4 :4;
  } MergedBits;
} APCTL1STR;
extern volatile APCTL1STR _APCTL1 @0x0000189F;
#define APCTL1                          _APCTL1.Byte
#define APCTL1_ADPC0                    _APCTL1.Bits.ADPC0
#define APCTL1_ADPC4                    _APCTL1.Bits.ADPC4
#define APCTL1_ADPC5                    _APCTL1.Bits.ADPC5
#define APCTL1_ADPC6                    _APCTL1.Bits.ADPC6
#define APCTL1_ADPC7                    _APCTL1.Bits.ADPC7
#define APCTL1_ADPC_4                   _APCTL1.MergedBits.grpADPC_4
#define APCTL1_ADPC                     APCTL1_ADPC_4

#define APCTL1_ADPC0_MASK               1
#define APCTL1_ADPC4_MASK               16
#define APCTL1_ADPC5_MASK               32
#define APCTL1_ADPC6_MASK               64
#define APCTL1_ADPC7_MASK               128
#define APCTL1_ADPC_4_MASK              240
#define APCTL1_ADPC_4_BITNUM            4


/*** APCTL2 - Pin Control 2 Register; 0x000018A0 ***/
typedef union {
  byte Byte;
  struct {
    byte ADPC8       :1;                                       /* ADC Pin Control 8 - ADPC8 is used to control the pin associated with channel AD8 */
    byte ADPC9       :1;                                       /* ADC Pin Control 9 - ADPC9 is used to control the pin associated with channel AD9 */
    byte ADPC10      :1;                                       /* ADC Pin Control 10 - ADPC10 is used to control the pin associated with channel AD10 */
    byte ADPC11      :1;                                       /* ADC Pin Control 11 - ADPC11 is used to control the pin associated with channel AD11 */
    byte ADPC12      :1;                                       /* ADC Pin Control 12 - ADPC12 is used to control the pin associated with channel AD12 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpADPC_8 :5;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} APCTL2STR;
extern volatile APCTL2STR _APCTL2 @0x000018A0;
#define APCTL2                          _APCTL2.Byte
#define APCTL2_ADPC8                    _APCTL2.Bits.ADPC8
#define APCTL2_ADPC9                    _APCTL2.Bits.ADPC9
#define APCTL2_ADPC10                   _APCTL2.Bits.ADPC10
#define APCTL2_ADPC11                   _APCTL2.Bits.ADPC11
#define APCTL2_ADPC12                   _APCTL2.Bits.ADPC12
#define APCTL2_ADPC_8                   _APCTL2.MergedBits.grpADPC_8
#define APCTL2_ADPC                     APCTL2_ADPC_8

#define APCTL2_ADPC8_MASK               1
#define APCTL2_ADPC9_MASK               2
#define APCTL2_ADPC10_MASK              4
#define APCTL2_ADPC11_MASK              8
#define APCTL2_ADPC12_MASK              16
#define APCTL2_ADPC_8_MASK              31
#define APCTL2_ADPC_8_BITNUM            0


