bstack88/line-following-robot/LineFollower/Project_Headers/mc9s08ll64.h
#define NVBACKKEY6_KEY0_MASK            1
#define NVBACKKEY6_KEY1_MASK            2
#define NVBACKKEY6_KEY2_MASK            4
#define NVBACKKEY6_KEY3_MASK            8
#define NVBACKKEY6_KEY4_MASK            16
#define NVBACKKEY6_KEY5_MASK            32
#define NVBACKKEY6_KEY6_MASK            64
#define NVBACKKEY6_KEY7_MASK            128


/*** NVBACKKEY7 - Backdoor Comparison Key 7; 0x0000FFB7 ***/
typedef union {
  byte Byte;
  struct {
    byte KEY0        :1;                                       /* Backdoor Comparison Key 7 Bits, bit 0 */
    byte KEY1        :1;                                       /* Backdoor Comparison Key 7 Bits, bit 1 */
    byte KEY2        :1;                                       /* Backdoor Comparison Key 7 Bits, bit 2 */
    byte KEY3        :1;                                       /* Backdoor Comparison Key 7 Bits, bit 3 */
    byte KEY4        :1;                                       /* Backdoor Comparison Key 7 Bits, bit 4 */
    byte KEY5        :1;                                       /* Backdoor Comparison Key 7 Bits, bit 5 */
    byte KEY6        :1;                                       /* Backdoor Comparison Key 7 Bits, bit 6 */
    byte KEY7        :1;                                       /* Backdoor Comparison Key 7 Bits, bit 7 */
  } Bits;
} NVBACKKEY7STR;
/* Tip for register initialization in the user code:  const byte NVBACKKEY7_INIT @0x0000FFB7 = <NVBACKKEY7_INITVAL>; */
#define _NVBACKKEY7 (*(const NVBACKKEY7STR * __far)0x0000FFB7)
#define NVBACKKEY7                      _NVBACKKEY7.Byte
#define NVBACKKEY7_KEY0                 _NVBACKKEY7.Bits.KEY0
#define NVBACKKEY7_KEY1                 _NVBACKKEY7.Bits.KEY1
#define NVBACKKEY7_KEY2                 _NVBACKKEY7.Bits.KEY2
#define NVBACKKEY7_KEY3                 _NVBACKKEY7.Bits.KEY3
#define NVBACKKEY7_KEY4                 _NVBACKKEY7.Bits.KEY4
#define NVBACKKEY7_KEY5                 _NVBACKKEY7.Bits.KEY5
#define NVBACKKEY7_KEY6                 _NVBACKKEY7.Bits.KEY6
#define NVBACKKEY7_KEY7                 _NVBACKKEY7.Bits.KEY7

#define NVBACKKEY7_KEY0_MASK            1
#define NVBACKKEY7_KEY1_MASK            2
#define NVBACKKEY7_KEY2_MASK            4
#define NVBACKKEY7_KEY3_MASK            8
#define NVBACKKEY7_KEY4_MASK            16
#define NVBACKKEY7_KEY5_MASK            32
#define NVBACKKEY7_KEY6_MASK            64
#define NVBACKKEY7_KEY7_MASK            128


/*** NVPROT - Nonvolatile Flash Protection Register; 0x0000FFBD ***/
typedef union {
  byte Byte;
  struct {
    byte FPDIS       :1;                                       /* Flash Protection Disable */
    byte FPS0        :1;                                       /* Flash Protection Size, bit 0 */
    byte FPS1        :1;                                       /* Flash Protection Size, bit 1 */
    byte FPS2        :1;                                       /* Flash Protection Size, bit 2 */
    byte FPS3        :1;                                       /* Flash Protection Size, bit 3 */
    byte FPS4        :1;                                       /* Flash Protection Size, bit 4 */
    byte FPS5        :1;                                       /* Flash Protection Size, bit 5 */
    byte FPS6        :1;                                       /* Flash Protection Size, bit 6 */
  } Bits;
  struct {
    byte         :1;
    byte grpFPS  :7;
  } MergedBits;
} NVPROTSTR;
/* Tip for register initialization in the user code:  const byte NVPROT_INIT @0x0000FFBD = <NVPROT_INITVAL>; */
#define _NVPROT (*(const NVPROTSTR * __far)0x0000FFBD)
#define NVPROT                          _NVPROT.Byte
#define NVPROT_FPDIS                    _NVPROT.Bits.FPDIS
#define NVPROT_FPS0                     _NVPROT.Bits.FPS0
#define NVPROT_FPS1                     _NVPROT.Bits.FPS1
#define NVPROT_FPS2                     _NVPROT.Bits.FPS2
#define NVPROT_FPS3                     _NVPROT.Bits.FPS3
#define NVPROT_FPS4                     _NVPROT.Bits.FPS4
#define NVPROT_FPS5                     _NVPROT.Bits.FPS5
#define NVPROT_FPS6                     _NVPROT.Bits.FPS6
#define NVPROT_FPS                      _NVPROT.MergedBits.grpFPS

#define NVPROT_FPDIS_MASK               1
#define NVPROT_FPS0_MASK                2
#define NVPROT_FPS1_MASK                4
#define NVPROT_FPS2_MASK                8
#define NVPROT_FPS3_MASK                16
#define NVPROT_FPS4_MASK                32
#define NVPROT_FPS5_MASK                64
#define NVPROT_FPS6_MASK                128
#define NVPROT_FPS_MASK                 254
#define NVPROT_FPS_BITNUM               1


/*** NVOPT - Nonvolatile Flash Options Register; 0x0000FFBF ***/
typedef union {
  byte Byte;
  struct {
    byte SEC0        :1;                                       /* Flash Security Bit 0 */
    byte SEC1        :1;                                       /* Flash Security Bit 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte FNORED      :1;                                       /* Vector Redirection Disable */
    byte KEYEN       :1;                                       /* Backdoor Key Security Enable */
  } Bits;
  struct {
    byte grpSEC  :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} NVOPTSTR;
/* Tip for register initialization in the user code:  const byte NVOPT_INIT @0x0000FFBF = <NVOPT_INITVAL>; */
#define _NVOPT (*(const NVOPTSTR * __far)0x0000FFBF)
#define NVOPT                           _NVOPT.Byte
#define NVOPT_SEC0                      _NVOPT.Bits.SEC0
#define NVOPT_SEC1                      _NVOPT.Bits.SEC1
#define NVOPT_FNORED                    _NVOPT.Bits.FNORED
#define NVOPT_KEYEN                     _NVOPT.Bits.KEYEN
#define NVOPT_SEC                       _NVOPT.MergedBits.grpSEC

#define NVOPT_SEC0_MASK                 1
#define NVOPT_SEC1_MASK                 2
#define NVOPT_FNORED_MASK               64
#define NVOPT_KEYEN_MASK                128
#define NVOPT_SEC_MASK                  3
#define NVOPT_SEC_BITNUM                0



/* Flash commands */
#define mBlank                          0x05
#define mBurstProg                      0x25
#define mByteProg                       0x20
#define mMassErase                      0x41
#define mPageErase                      0x40


/***********************************************/
/**   D E P R E C I A T E D   S Y M B O L S   **/
/***********************************************/
/* --------------------------------------------------------------------------- */
/* The following symbols were removed, because they were invalid or irrelevant */
/* --------------------------------------------------------------------------- */



/* **** 19.2.2009 17:22:36 */

#define ADCRH_D12                        This_symb_has_been_depreciated
#define ADCRH_D13                        This_symb_has_been_depreciated
#define ADCRH_D14                        This_symb_has_been_depreciated
#define ADCRH_D15                        This_symb_has_been_depreciated
#define ADCRH_D12_MASK                   This_symb_has_been_depreciated
#define ADCRH_D13_MASK                   This_symb_has_been_depreciated
#define ADCRH_D14_MASK                   This_symb_has_been_depreciated
#define ADCRH_D15_MASK                   This_symb_has_been_depreciated
#define VREFTRM1                         VREF1TRM
#define VREFTRM1_TRM10                   VREF1TRM_TRM0
#define VREFTRM1_TRM11                   VREF1TRM_TRM1
#define VREFTRM1_TRM12                   VREF1TRM_TRM2
#define VREFTRM1_TRM13                   VREF1TRM_TRM3
#define VREFTRM1_TRM14                   VREF1TRM_TRM4
#define VREFTRM1_TRM15                   VREF1TRM_TRM5
#define VREFTRM1_TRM16                   VREF1TRM_TRM6
#define VREFTRM1_TRM17                   VREF1TRM_TRM7
#define VREFTRM1_TRM10_MASK              VREF1TRM_TRM0_MASK
#define VREFTRM1_TRM11_MASK              VREF1TRM_TRM1_MASK
#define VREFTRM1_TRM12_MASK              VREF1TRM_TRM2_MASK
#define VREFTRM1_TRM13_MASK              VREF1TRM_TRM3_MASK
#define VREFTRM1_TRM14_MASK              VREF1TRM_TRM4_MASK
#define VREFTRM1_TRM15_MASK              VREF1TRM_TRM5_MASK
#define VREFTRM1_TRM16_MASK              VREF1TRM_TRM6_MASK
#define VREFTRM1_TRM17_MASK              VREF1TRM_TRM7_MASK
#define VREFSC1                          VREF1SC
#define VREFSC1_MODE10                   VREF1SC_MODE0
#define VREFSC1_MODE11                   This_symb_has_been_depreciated
#define VREFSC1_VREFST1                  VREF1SC_VREFST
#define VREFSC1_VREFEN1                  VREF1SC_VREFEN
#define VREFSC1_MODE1                    VREF1SC_MODE1
#define VREFSC1_MODE10_MASK              VREF1SC_MODE0_MASK
#define VREFSC1_MODE11_MASK              This_symb_has_been_depreciated
#define VREFSC1_VREFST1_MASK             VREF1SC_VREFST_MASK
#define VREFSC1_VREFEN1_MASK             VREF1SC_VREFEN_MASK
#define VREFSC1_MODE1_MASK               VREF1SC_MODE1_MASK
#define VREFSC1_MODE1_BITNUM             VREF1SC_MODE_BITNUM
#define VREFTRM2                         VREF2TRM                      
#define VREFTRM2_TRM20                   VREF2TRM_TRM0                 
#define VREFTRM2_TRM21                   VREF2TRM_TRM1                 
#define VREFTRM2_TRM22                   VREF2TRM_TRM2                 
#define VREFTRM2_TRM23                   VREF2TRM_TRM3                 
#define VREFTRM2_TRM24                   VREF2TRM_TRM4                 
#define VREFTRM2_TRM25                   VREF2TRM_TRM5                 
#define VREFTRM2_TRM26                   VREF2TRM_TRM6                 
#define VREFTRM2_TRM27                   VREF2TRM_TRM7                 
#define VREFTRM2_TRM20_MASK              VREF2TRM_TRM0_MASK            
#define VREFTRM2_TRM21_MASK              VREF2TRM_TRM1_MASK            
#define VREFTRM2_TRM22_MASK              VREF2TRM_TRM2_MASK            
#define VREFTRM2_TRM23_MASK              VREF2TRM_TRM3_MASK            
#define VREFTRM2_TRM24_MASK              VREF2TRM_TRM4_MASK            
#define VREFTRM2_TRM25_MASK              VREF2TRM_TRM5_MASK            
#define VREFTRM2_TRM26_MASK              VREF2TRM_TRM6_MASK            
#define VREFTRM2_TRM27_MASK              VREF2TRM_TRM7_MASK            
#define VREFSC2                          VREF2SC                       
#define VREFSC2_MODE20                   VREF2SC_MODE0                 
#define VREFSC2_MODE21                   This_symb_has_been_depreciated
#define VREFSC2_VREFST2                  VREF2SC_VREFST                
#define VREFSC2_VREFEN2                  VREF2SC_VREFEN                
#define VREFSC2_MODE2                    VREF2SC_MODE1                 
#define VREFSC2_MODE20_MASK              VREF2SC_MODE0_MASK            
#define VREFSC2_MODE21_MASK              This_symb_has_been_depreciated
#define VREFSC2_VREFST2_MASK             VREF2SC_VREFST_MASK           
#define VREFSC2_VREFEN2_MASK             VREF2SC_VREFEN_MASK           
#define VREFSC2_MODE2_MASK               VREF2SC_MODE1_MASK            
#define VREFSC2_MODE2_BITNUM             VREF2SC_MODE_BITNUM           
#define ADCCV1H_CV112                    This_symb_has_been_depreciated
#define ADCCV1H_CV113                    This_symb_has_been_depreciated
#define ADCCV1H_CV114                    This_symb_has_been_depreciated
#define ADCCV1H_CV115                    This_symb_has_been_depreciated
#define ADCCV1H_CV112_MASK               This_symb_has_been_depreciated
#define ADCCV1H_CV113_MASK               This_symb_has_been_depreciated
#define ADCCV1H_CV114_MASK               This_symb_has_been_depreciated
#define ADCCV1H_CV115_MASK               This_symb_has_been_depreciated
#define _NVVREFTRM1                      _NVVREF1TRM
#define NVVREFTRM1                       NVVREF1TRM
#define NVVREFTRM1_TRM10                 NVVREF1TRM_TRM0
#define NVVREFTRM1_TRM11                 NVVREF1TRM_TRM1
#define NVVREFTRM1_TRM12                 NVVREF1TRM_TRM2
#define NVVREFTRM1_TRM13                 NVVREF1TRM_TRM3
#define NVVREFTRM1_TRM14                 NVVREF1TRM_TRM4
#define NVVREFTRM1_TRM15                 NVVREF1TRM_TRM5
#define NVVREFTRM1_TRM16                 NVVREF1TRM_TRM6
#define NVVREFTRM1_TRM17                 NVVREF1TRM_TRM7
#define NVVREFTRM1_TRM10_MASK            NVVREF1TRM_TRM0_MASK
#define NVVREFTRM1_TRM11_MASK            NVVREF1TRM_TRM1_MASK
#define NVVREFTRM1_TRM12_MASK            NVVREF1TRM_TRM2_MASK
#define NVVREFTRM1_TRM13_MASK            NVVREF1TRM_TRM3_MASK
#define NVVREFTRM1_TRM14_MASK            NVVREF1TRM_TRM4_MASK
#define NVVREFTRM1_TRM15_MASK            NVVREF1TRM_TRM5_MASK
#define NVVREFTRM1_TRM16_MASK            NVVREF1TRM_TRM6_MASK
#define NVVREFTRM1_TRM17_MASK            NVVREF1TRM_TRM7_MASK
#define _NVVREFTRM2                      _NVVREF2TRM         
#define NVVREFTRM2                       NVVREF2TRM          
#define NVVREFTRM2_TRM20                 NVVREF2TRM_TRM0     
#define NVVREFTRM2_TRM21                 NVVREF2TRM_TRM1     
#define NVVREFTRM2_TRM22                 NVVREF2TRM_TRM2     
#define NVVREFTRM2_TRM23                 NVVREF2TRM_TRM3     
#define NVVREFTRM2_TRM24                 NVVREF2TRM_TRM4     
#define NVVREFTRM2_TRM25                 NVVREF2TRM_TRM5     
#define NVVREFTRM2_TRM26                 NVVREF2TRM_TRM6     
#define NVVREFTRM2_TRM27                 NVVREF2TRM_TRM7     
#define NVVREFTRM2_TRM20_MASK            NVVREF2TRM_TRM0_MASK
#define NVVREFTRM2_TRM21_MASK            NVVREF2TRM_TRM1_MASK
#define NVVREFTRM2_TRM22_MASK            NVVREF2TRM_TRM2_MASK
#define NVVREFTRM2_TRM23_MASK            NVVREF2TRM_TRM3_MASK
#define NVVREFTRM2_TRM24_MASK            NVVREF2TRM_TRM4_MASK
#define NVVREFTRM2_TRM25_MASK            NVVREF2TRM_TRM5_MASK
#define NVVREFTRM2_TRM26_MASK            NVVREF2TRM_TRM6_MASK
#define NVVREFTRM2_TRM27_MASK            NVVREF2TRM_TRM7_MASK

/* **** 25.9.2009 10:57:34 */

#define ADCCV1H                          ADCCVH
#define ADCCV1H_CV18                     ADCCVH_CV8 
#define ADCCV1H_CV19                     ADCCVH_CV9 
#define ADCCV1H_CV110                    ADCCVH_CV10
#define ADCCV1H_CV111                    ADCCVH_CV11
#define ADCCV1H_CV_18                    ADCCVH_CV_8
#define ADCCV1H_CV1_10                   This_symb_has_been_depreciated
#define ADCCV1H_CV                       This_symb_has_been_depreciated
#define ADCCV1H_CV1                      ADCCVH_CV
#define ADCCV1H_CV18_MASK                ADCCVH_CV8_MASK
#define ADCCV1H_CV19_MASK                ADCCVH_CV9_MASK
#define ADCCV1H_CV110_MASK               ADCCVH_CV10_MASK
#define ADCCV1H_CV111_MASK               ADCCVH_CV11_MASK
#define ADCCV1H_CV_18_MASK               ADCCVH_CV_8_MASK
#define ADCCV1H_CV_18_BITNUM             ADCCVH_CV_8_BITNUM
#define ADCCV1H_CV1_10_MASK              This_symb_has_been_depreciated
#define ADCCV1H_CV1_10_BITNUM            This_symb_has_been_depreciated
#define ADCCV1L                          ADCCVL
#define ADCCV1L_CV10                     ADCCVL_CV0
#define ADCCV1L_CV11                     ADCCVL_CV1
#define ADCCV1L_CV12                     ADCCVL_CV2
#define ADCCV1L_CV13                     ADCCVL_CV3
#define ADCCV1L_CV14                     ADCCVL_CV4
#define ADCCV1L_CV15                     ADCCVL_CV5
#define ADCCV1L_CV16                     ADCCVL_CV6
#define ADCCV1L_CV17                     ADCCVL_CV7
#define ADCCV1L_CV10_MASK                ADCCVL_CV0_MASK
#define ADCCV1L_CV11_MASK                ADCCVL_CV1_MASK
#define ADCCV1L_CV12_MASK                ADCCVL_CV2_MASK
#define ADCCV1L_CV13_MASK                ADCCVL_CV3_MASK
#define ADCCV1L_CV14_MASK                ADCCVL_CV4_MASK
#define ADCCV1L_CV15_MASK                ADCCVL_CV5_MASK
#define ADCCV1L_CV16_MASK                ADCCVL_CV6_MASK
#define ADCCV1L_CV17_MASK                ADCCVL_CV7_MASK
#define ADCCV1                           ADCCV

/* **** 27.11.2009 11:30:38 */

#define PPAGE_XA16                       This_symb_has_been_depreciated
#define PPAGE_XA16_MASK                  This_symb_has_been_depreciated
#endif
